# 5. Напишите программу, которая принимает на вход координаты двух точек и
# находит расстояние между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
print ('Введите координаты точки А:')
ax = float(input('ax = '))
ay = float(input('ay = '))
print ('Введите координаты точки B:')
bx = float(input('bx = '))
by = float(input('by = '))
result = ((bx - ax) ** 2 + (by - ay) ** 2) ** (0.5)
print(round(result, 2))
